//---------------------------------------------------------------------------

#include <fmx.h>
#pragma hdrstop

#include "PristavkiWindowUnit.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.fmx"
#pragma resource ("*.Windows.fmx", _PLAT_MSWINDOWS)

TPristavkiForm *PristavkiForm;
//---------------------------------------------------------------------------
__fastcall TPristavkiForm::TPristavkiForm(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
void __fastcall TPristavkiForm::НачатьClick(TObject *Sender)
{
	Label3->Text="0";
	Label4->Text="0";
	Timer1->Enabled=true;

	StringGrid1->Cells[0][0]="1. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][1]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][0]="1) пр..волжский, пр..карманить, пр..стегнуться";
	StringGrid1->Cells[1][1]="2) ни..послать, ра..жать, обе..денежеть";
	StringGrid1->Cells[1][2]="3) под..тожить, пред..дущий, без..скусный";
	StringGrid1->Cells[1][3]="4) п..едестал, в..явь, из..ять";
	StringGrid1->Cells[1][4]="5) поз..вчера, над..рвался, нед..жарили";

	StringGrid1->Cells[0][5]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][5]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][5]="--------------------";

	StringGrid1->Cells[0][6]="2. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][7]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][6]="1) пр..обретение, пр..градить, пр..интересный";
	StringGrid1->Cells[1][7]="2) не..держанность, бе..человечный ,в..ходы";
	StringGrid1->Cells[1][8]="3) з..ночевать, нен..глядный, пр..бабушка";
	StringGrid1->Cells[1][9]="4) об..ективный, доб..ётся, из..ян";
	StringGrid1->Cells[1][10]="5) о..цвести, пре..сказание, о..вёртка";

	StringGrid1->Cells[0][11]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][11]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][11]="--------------------";

	StringGrid1->Cells[0][12]="3. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][13]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][12]="1) пр..возмочь, пр..дания (старины), пр..рываемый";
	StringGrid1->Cells[1][13]="2) не..говорчивый, бе..цельный, в..дремнуть";
	StringGrid1->Cells[1][14]="3) соб..ётся, супер..яркий, в..ётся";
	StringGrid1->Cells[1][15]="4) о..бойный (молоток), на..строчный, по..черкни";
	StringGrid1->Cells[1][16]="5) от..скать, под..тожить, с..змала";

	StringGrid1->Cells[0][17]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][17]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][17]="--------------------";

	StringGrid1->Cells[0][18]="4. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][19]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][18]="1) пр..обрёл, пр..образователь, сверх..нтересный";
	StringGrid1->Cells[1][19]="2) п..дсказывать, п..никнуть, д..ехать";
	StringGrid1->Cells[1][20]="3) п..едестал, ал..тернатива, б..ются";
	StringGrid1->Cells[1][21]="4) и..древле, не..держанный, не..добровать";
	StringGrid1->Cells[1][22]="5) оп..знание, нер..створимый, п..йдём";

	StringGrid1->Cells[0][23]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][23]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][23]="--------------------";

	StringGrid1->Cells[0][24]="5. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][25]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][24]="1) пр..мыкающий (сбоку), пр..паркованные (возле дома), пр..бедняться";
	StringGrid1->Cells[1][25]="2) и..худавший (от голода), ра..черченный (лист), во..хвалял";
	StringGrid1->Cells[1][26]="3) в..езжает (в город), вз..ерошенный, четырёх..ярусный";
	StringGrid1->Cells[1][27]="4) супер..гра, роз..грыш, из..скать";
	StringGrid1->Cells[1][28]="5) д..жевал (хлеб), з..чинщик, н..слаждение";

	StringGrid1->Cells[0][29]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][29]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][29]="--------------------";

	StringGrid1->Cells[0][30]="6. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][31]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][30]="1) з..подозрить, нед..выполнить, п..молчать";
	StringGrid1->Cells[1][31]="2) пр..морский, пр..выкнуть, без пр..крас";
	StringGrid1->Cells[1][32]="3) и..быточный, во..хождение, ни..вергнуть";
	StringGrid1->Cells[1][33]="4) по..бросить, о..пилить, о..крыть";
	StringGrid1->Cells[1][34]="5) пр..мудрый, пр..красный, пр..возмочь";

	StringGrid1->Cells[0][35]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][35]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][35]="--------------------";

	StringGrid1->Cells[0][36]="7. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][37]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][36]="1) бе..голосый, чере..чур, во..пламенеть";
	StringGrid1->Cells[1][37]="2) д..ячок, кар..ера, п..едестал";
	StringGrid1->Cells[1][38]="3) не..писуемый, поз..прошлый, п..рядок";
	StringGrid1->Cells[1][39]="4) непр..миримый, пр..близить, пр..звание";
	StringGrid1->Cells[1][40]="5) от..мстить, перер..спределение, р..сстрел";

	StringGrid1->Cells[0][41]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][41]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][41]="--------------------";

	StringGrid1->Cells[0][42]="8. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][43]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][42]="1) об..греться, пр..питанный, пр..сматривать (статью)";
	StringGrid1->Cells[1][43]="2) про..грать, с..змала, дез..нфекция";
	StringGrid1->Cells[1][44]="3) ра..мешать, бе..численный, и..чезнуть";
	StringGrid1->Cells[1][45]="4) пр..старелый, пр..открыть, пр..вокзальный";
	StringGrid1->Cells[1][46]="5) нед..варить, п..краска, п..дкова";

	StringGrid1->Cells[0][47]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][47]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][47]="--------------------";

	StringGrid1->Cells[0][48]="9. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][49]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][48]="1) п..иск, неп..ддающийся, от..двинуть";
	StringGrid1->Cells[1][49]="2) ра..бросать, и..пуганный, бе..вольный";
	StringGrid1->Cells[1][50]="3) пр..следовать, пр..милый, пр..смыкающийся";
	StringGrid1->Cells[1][51]="4) с..еденный, сер..ёзный, ад..ютант";
	StringGrid1->Cells[1][52]="5) нап..следок, н..слаждаться, д..браться";

	StringGrid1->Cells[0][53]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][53]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][53]="--------------------";

	StringGrid1->Cells[0][54]="10. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][55]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][54]="1) пр..плясывал (от нетерпенья), пр..волье, непр..ступная (крепость)";
	StringGrid1->Cells[1][55]="2) о..быть (по назначению), по..ковать (коня), на..кусить";
	StringGrid1->Cells[1][56]="3) раз..ём, в..юнок, п..еса";
	StringGrid1->Cells[1][57]="4) бе..костный, ра..смеяться, в..пыхнуть";
	StringGrid1->Cells[1][58]="5) роз..ск, пост..мпрессионизм, сверх..нтеллектуальный";

	StringGrid1->Cells[0][59]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][59]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][59]="--------------------";

	StringGrid1->Cells[0][60]="11. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][61]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][60]="1) вз..скать, по..скать, вз..грать";
	StringGrid1->Cells[1][61]="2) чере..чур, бе..болезненный, ра..крошить";
	StringGrid1->Cells[1][62]="3) беспр..станно, пр..образование, пр..зидент";
	StringGrid1->Cells[1][63]="4) п..полнять, поз..вчера, пр..образ";
	StringGrid1->Cells[1][64]="5) по..бородок, по..ставка, по..мастерье";

	StringGrid1->Cells[0][65]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][65]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][65]="--------------------";

	StringGrid1->Cells[0][66]="12. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][67]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][66]="1) сверх..зящный, пост..нсультный, вз..мать";
	StringGrid1->Cells[1][67]="2) во..пламениться, бе..совестный, не..балансированный";
	StringGrid1->Cells[1][68]="3) (старинное) пр..дание, пр..верженец, непр..емлемый";
	StringGrid1->Cells[1][69]="4) с..естной, волеиз..явление, двух..ядерный";
	StringGrid1->Cells[1][70]="5) не..хватный, р..списывать, с..переживающий";

	StringGrid1->Cells[0][71]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][71]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][71]="--------------------";

	StringGrid1->Cells[0][72]="13. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][73]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][72]="1) пр..глушить, пр..дставить, пр..творить (дверь)";
	StringGrid1->Cells[1][73]="2) и..гнать, не..гораемый, и..менить";
	StringGrid1->Cells[1][74]="3) пред..нвестиционный, под..тожить, за..скрить";
	StringGrid1->Cells[1][75]="4) непр..будный, в..скликнуть, в..ткнуть";
	StringGrid1->Cells[1][76]="5) на..треснутый, по..крадываться, по..расти";

	StringGrid1->Cells[0][77]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][77]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][77]="--------------------";

	StringGrid1->Cells[0][78]="14. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][79]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][78]="1) пр..страстный, пр..вышение (скорости), пр..града";
	StringGrid1->Cells[1][79]="2) бе..грамотный, чре..мерный, во..звание";
	StringGrid1->Cells[1][80]="3) р..сположившийся, пон..слышке; р..звал";
	StringGrid1->Cells[1][81]="4) с..ехидничать, уст..е, в..юга";
	StringGrid1->Cells[1][82]="5) неп..ладки, н..вьючить, п..лагать";

	StringGrid1->Cells[0][83]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][83]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][83]="--------------------";

	StringGrid1->Cells[0][84]="15. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][85]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][84]="1) пре..чувствовать, о..крутить, по..ставить";
	StringGrid1->Cells[1][85]="2) раз..чаровать, с..брать, с..трудник";
	StringGrid1->Cells[1][86]="3) кон..юнктура, с..ёжиться, в..елся";
	StringGrid1->Cells[1][87]="4) беспр..станно, сопр..частность, пр..дворный";
	StringGrid1->Cells[1][88]="5) спец..нструмент, пост..мпрессионизм, пред..юльский";

	StringGrid1->Cells[0][89]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][89]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][89]="--------------------";

	StringGrid1->Cells[0][90]="16. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][91]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][90]="1) ра..буженный, бе..граничный, и..вестить";
	StringGrid1->Cells[1][91]="2) н..испособнейший, поз..вчера, н..дстройка";
	StringGrid1->Cells[1][92]="3) сверх..зысканно, меж..здательский, пред..дущий";
	StringGrid1->Cells[1][93]="4) пр..следовать (врага), пр..купить, пр..шить (пуговицу)";
	StringGrid1->Cells[1][94]="5) по..черкнуть, на..пись, пре..писание";

	StringGrid1->Cells[0][95]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][95]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][95]="--------------------";

	StringGrid1->Cells[0][96]="17. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][97]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][99]="1) ра..шифровать, ра..твориться, ра..чётливый";
	StringGrid1->Cells[1][97]="2) пр..изошло, д..ход, п..дстраховаться";
	StringGrid1->Cells[1][98]="3) без..дейный, об..гранный, небез..нтересный";
	StringGrid1->Cells[1][99]="4) пр..открыть, пр..чалить, пр..стольный (град)";
	StringGrid1->Cells[1][100]="5) неот..емлемый, коп..ё, необ..ятный";

	StringGrid1->Cells[0][101]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][101]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][101]="--------------------";

	StringGrid1->Cells[0][102]="18. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][103]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][102]="1) пр..общиться, пр..школьный, пр..встать";
	StringGrid1->Cells[1][103]="2) вз..браться, п..забавить, р..ссказ";
	StringGrid1->Cells[1][104]="3) ни..вергать, и..черпать, в..дрогнуть";
	StringGrid1->Cells[1][105]="4) об..явить, с..ёмка, суб..ект";
	StringGrid1->Cells[1][106]="5) от..всюду, нар..спашку,п..дсветка";

	StringGrid1->Cells[0][107]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][107]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][107]="--------------------";

	StringGrid1->Cells[0][108]="19. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][109]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][108]="1) не..глядный, з..головок, з..гляденье";
	StringGrid1->Cells[1][109]="2) во..горание, в..драгивать, ра..витие";
	StringGrid1->Cells[1][110]="3) меж..гровой, по..грать, сверх..зысканный";
	StringGrid1->Cells[1][111]="4) пр..обрел, пр..образователь, пр..оритет";
	StringGrid1->Cells[1][112]="5) суб..ективный, оп..янение, в..юн";

	StringGrid1->Cells[0][113]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][113]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][113]="--------------------";

	StringGrid1->Cells[0][114]="20. Укажите варианты ответов, в которых во всех словах одного";
	StringGrid1->Cells[0][115]="ряда пропущена одна и та же буква. Запишите номера ответов.";
	StringGrid1->Cells[1][114]="1) пр..образовать, пр..неприятный, пр..следовать";
	StringGrid1->Cells[1][115]="2) сверх..естественный, с..ёмка, двух..ярусный";
	StringGrid1->Cells[1][116]="3) п..никнуть, пр..дедушка, поз..вчера";
	StringGrid1->Cells[1][117]="4) чере..чур, и..синя-чёрный, бе..крайний";
	StringGrid1->Cells[1][118]="5) вз..скать, без..нициативный, сверх..зысканный";

	StringGrid1->Cells[0][119]="-----------------------------------------------------------------------------";
	StringGrid1->Cells[1][119]="-----------------------------------------------------------------------------------------------------";
	StringGrid1->Cells[2][119]="--------------------";

	int i;
	for (i = 5; i < 120; i+=6) {
		  StringGrid1->Cells[0][i]="-----------------------------------------------------------------------------";
		  StringGrid1->Cells[1][i]="---------------------------------------------------------------------------------";
		  StringGrid1->Cells[2][i]="--------------------";
		  StringGrid1->Cells[2][i-1]="--------------------";
		  StringGrid1->Cells[2][i-2]="--------------------";
		  StringGrid1->Cells[2][i-3]="--------------------";
		  StringGrid1->Cells[2][i-4]="--------------------";
	}
}
//---------------------------------------------------------------------------
void __fastcall TPristavkiForm::ЗакрытьClick(TObject *Sender)
{
	Close();

	int i;
	for (i = 0; i < 120; i++) {
		 StringGrid1->Cells[0][i]="";
		 StringGrid1->Cells[1][i]="";
		 StringGrid1->Cells[2][i]="";
	}
    Label3->Text="0";
	Label4->Text="0";
	Timer1->Enabled=false;
}
//---------------------------------------------------------------------------
void __fastcall TPristavkiForm::CheckButtonClick(TObject *Sender)
{
	Timer1->Enabled=false;
    StringColumn3->ReadOnly=true;

	int s=0;

	if (StringGrid1->Cells[2][0]=="13") {
		s++;
		StringGrid1->Cells[2][1]="ВЕРНО";
	}
	else StringGrid1->Cells[2][1]="НЕВЕРНО";

	if (StringGrid1->Cells[2][6]=="34") {
		s++;
		StringGrid1->Cells[2][7]="ВЕРНО";
	}
	else StringGrid1->Cells[2][7]="НЕВЕРНО";

	if (StringGrid1->Cells[2][12]=="15") {
		s++;
		StringGrid1->Cells[2][13]="ВЕРНО";
	}
	else StringGrid1->Cells[2][13]="НЕВЕРНО";

	if (StringGrid1->Cells[2][18]=="23") {
		s++;
		StringGrid1->Cells[2][19]="ВЕРНО";
	}
	else StringGrid1->Cells[2][19]="НЕВЕРНО";

	if (StringGrid1->Cells[2][24]=="123") {
		s++;
		StringGrid1->Cells[2][25]="ВЕРНО";
	}
	else StringGrid1->Cells[2][25]="НЕВЕРНО";

	if (StringGrid1->Cells[2][30]=="25") {
		s++;
		StringGrid1->Cells[2][31]="ВЕРНО";
	}
	else StringGrid1->Cells[2][31]="НЕВЕРНО";

	if (StringGrid1->Cells[2][36]=="24") {
		s++;
		StringGrid1->Cells[2][37]="ВЕРНО";
	}
	else StringGrid1->Cells[2][37]="НЕВЕРНО";

	if (StringGrid1->Cells[2][42]=="15") {
		s++;
		StringGrid1->Cells[2][43]="ВЕРНО";
	}
	else StringGrid1->Cells[2][43]="НЕВЕРНО";

	if (StringGrid1->Cells[2][48]=="13") {
		s++;
		StringGrid1->Cells[2][49]="ВЕРНО";
	}
	else StringGrid1->Cells[2][49]="НЕВЕРНО";

	if (StringGrid1->Cells[2][54]=="14") {
		s++;
		StringGrid1->Cells[2][55]="ВЕРНО";
	}
	else StringGrid1->Cells[2][55]="НЕВЕРНО";

	if (StringGrid1->Cells[2][60]=="35") {
		s++;
		StringGrid1->Cells[2][61]="ВЕРНО";
	}
	else StringGrid1->Cells[2][61]="НЕВЕРНО";

	if (StringGrid1->Cells[2][66]=="124") {
		s++;
		StringGrid1->Cells[2][67]="ВЕРНО";
	}
	else StringGrid1->Cells[2][67]="НЕВЕРНО";

	if (StringGrid1->Cells[2][72]=="45") {
		s++;
		StringGrid1->Cells[2][73]="ВЕРНО";
	}
	else StringGrid1->Cells[2][73]="НЕВЕРНО";

	if (StringGrid1->Cells[2][78]=="23") {
		s++;
		StringGrid1->Cells[2][79]="ВЕРНО";
	}
	else StringGrid1->Cells[2][79]="НЕВЕРНО";

	if (StringGrid1->Cells[2][84]=="23") {
		s++;
		StringGrid1->Cells[2][85]="ВЕРНО";
	}
	else StringGrid1->Cells[2][85]="НЕВЕРНО";

	if (StringGrid1->Cells[2][90]=="125") {
		s++;
		StringGrid1->Cells[2][91]="ВЕРНО";
	}
	else StringGrid1->Cells[2][91]="НЕВЕРНО";

	if (StringGrid1->Cells[2][96]=="123") {
		s++;
		StringGrid1->Cells[2][97]="ВЕРНО";
	}
	else StringGrid1->Cells[2][97]="НЕВЕРНО";

	if (StringGrid1->Cells[2][102]=="14") {
		s++;
		StringGrid1->Cells[2][103]="ВЕРНО";
	}
	else StringGrid1->Cells[2][103]="НЕВЕРНО";

	if (StringGrid1->Cells[2][108]=="23") {
		s++;
		StringGrid1->Cells[2][109]="ВЕРНО";
	}
	else StringGrid1->Cells[2][109]="НЕВЕРНО";

	if (StringGrid1->Cells[2][114]=="124") {
		s++;
		StringGrid1->Cells[2][115]="ВЕРНО";
	}
	else StringGrid1->Cells[2][115]="НЕВЕРНО";

	CheckLabel->Text=IntToStr(s);
	Button1->Enabled=true;
}
//---------------------------------------------------------------------------
void __fastcall TPristavkiForm::Button1Click(TObject *Sender)
{
	StringGrid1->Cells[2][4]="13";
	StringGrid1->Cells[2][10]="23";
	StringGrid1->Cells[2][16]="15";
	StringGrid1->Cells[2][22]="23";
	StringGrid1->Cells[2][28]="123";
	StringGrid1->Cells[2][34]="25";
	StringGrid1->Cells[2][40]="24";
	StringGrid1->Cells[2][46]="15";
	StringGrid1->Cells[2][52]="13";
	StringGrid1->Cells[2][58]="14";
	StringGrid1->Cells[2][64]="35";
	StringGrid1->Cells[2][70]="124";
	StringGrid1->Cells[2][76]="45";
	StringGrid1->Cells[2][82]="23";
	StringGrid1->Cells[2][88]="23";
	StringGrid1->Cells[2][94]="125";
	StringGrid1->Cells[2][100]="123";
	StringGrid1->Cells[2][106]="14";
	StringGrid1->Cells[2][112]="23";
	StringGrid1->Cells[2][118]="124";
}
//---------------------------------------------------------------------------
void __fastcall TPristavkiForm::Timer1Timer(TObject *Sender)
{
	Label3->Text=IntToStr(StrToInt(Label3->Text)+1);

	if (StrToInt(Label3->Text)%60==0) {
		Label4->Text=IntToStr(StrToInt(Label4->Text)+1);
		Label3->Text="0";
	}

	if (StrToInt(Label4->Text==15)) {

		CheckLabel->Text="Время вышло \nНажмите проверить";
		Timer1->Enabled=false;
		StringColumn3->ReadOnly=true;
	}
}
//---------------------------------------------------------------------------



